Public Attributes | List of all members
API_PolyRoofData Struct Reference
Element Manager API
This structure holds the Multi-plane Roof specific data of API_RoofType. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_RoofLevelData  | levelData [16]
Fixed-size array of API_RoofLevelData items.
short  | levelNum
The actual number of levelData items (the maximum value is 16).
API_RoofOverHangTypeID  | overHangType
Overhang value is calculated or manually set for each roof segment.
double  | eavesOverHang
Eaves' extension outside the pivot polygon.
API_ShellBaseSegmentTypeID  | segmentType
Curve resolution method: by circle or by arc.
Int32  | segmentsByArc
Curve resolution value by arc.
Int32  | segmentsByCircle
Curve resolution value by circle.
bool  | fitSkylightToCurve
Place Skylights tangentially to curved surfaces rather than parallel to the individual segments.
API_Polygon  | pivotPolygon
The polygon constructed from the pivot edges of the roof planes. The actual data of the pivot polygon is held in the pivotPolyCoords, pivotPolyPends, pivotPolyParcs, and pivotPolyVertexIDs members of the API_ElementMemo structure.
API_Polygon  | contourPolygon
The contour polygon that cuts the roof on the horizontal plane. The actual data is held in the coords, pends, parcs, and vertexIDs members of the API_ElementMemo structure.
Detailed Description
This structure holds the Multi-plane Roof specific data of API_RoofType.
Remarks
For roof related memo data see the ACAPI_Element_GetMemo function. In order to enumerate the planes of the Multi-plane Roof, use the ACAPI_Element_Decompose function.
Member Data Documentation
◆ contourPolygon
 API_PolyRoofData::contourPolygon
The contour polygon that cuts the roof on the horizontal plane. The actual data is held in the coords, pends, parcs, and vertexIDs members of the API_ElementMemo structure.
◆ eavesOverHang
 API_PolyRoofData::eavesOverHang
Eaves' extension outside the pivot polygon.
◆ fitSkylightToCurve
 API_PolyRoofData::fitSkylightToCurve
Place Skylights tangentially to curved surfaces rather than parallel to the individual segments.
◆ levelData
 API_PolyRoofData::levelData
Fixed-size array of API_RoofLevelData items.
◆ levelNum
 API_PolyRoofData::levelNum
The actual number of levelData items (the maximum value is 16).
◆ overHangType
 API_PolyRoofData::overHangType
Overhang value is calculated or manually set for each roof segment.
◆ pivotPolygon
 API_PolyRoofData::pivotPolygon
The polygon constructed from the pivot edges of the roof planes. The actual data of the pivot polygon is held in the pivotPolyCoords, pivotPolyPends, pivotPolyParcs, and pivotPolyVertexIDs members of the API_ElementMemo structure.
◆ segmentsByArc
 API_PolyRoofData::segmentsByArc
Curve resolution value by arc.
◆ segmentsByCircle
 API_PolyRoofData::segmentsByCircle
Curve resolution value by circle.
◆ segmentType
 API_PolyRoofData::segmentType
Curve resolution method: by circle or by arc.